# Uso de Dataframe en Pandas
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [27]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
from pandas.tools.plotting import radviz

%matplotlib inline

In [28]:
df = pd.DataFrame({'date':['17 MAY2018']})
df

         date
0  17 MAY2018

In [5]:
df['date2'] = pd.to_datetime(df['date'])

df

         date      date2
0  17 MAY2018 2018-05-17

In [17]:
mi_df = pd.read_json('data/data-demo-3.json')

In [18]:
mi_df

  apellidos  edad   nombres
0  elizalde    10      rené
1     cueva     9   enrique
2  castillo    12    carlos
3   salinas    13     pedro
4   andrade    14  cristian

In [19]:
mi_df.dtypes

apellidos    object
edad          int64
nombres      object
dtype: object

In [20]:
mi_df['edad'] = mi_df['edad'].astype(float)
mi_df

  apellidos  edad   nombres
0  elizalde  10.0      rené
1     cueva   9.0   enrique
2  castillo  12.0    carlos
3   salinas  13.0     pedro
4   andrade  14.0  cristian

In [21]:
mi_df = pd.read_json('data/data-demo-4.json')

In [22]:
mi_df

  apellidos    edad   nombres
0  elizalde  edad10      rené
1     cueva   edad9   enrique
2  castillo  edad12    carlos
3   salinas  edad13     pedro
4   andrade  edad14  cristian

In [25]:
mi_df['edad2'] = mi_df['edad'].str.replace("edad", "").astype("int")

In [26]:
mi_df

  apellidos    edad   nombres  edad2
0  elizalde  edad10      rené     10
1     cueva   edad9   enrique      9
2  castillo  edad12    carlos     12
3   salinas  edad13     pedro     13
4   andrade  edad14  cristian     14